{
  "users": {
    "pastrychan": {
      "password": "FujoshiForever45",
      "is_admin": false,
      "bio": "Fangirl and fanfic writer!!!!",
      "username": "pastrychan",
      "pfp": "pfps/4d9276b2eabb191d70be71872ea5d0d7.webp",
      "ip": "127.0.0.1"
    },
    "alice": {
      "password": "password",
      "is_admin": false,
      "bio": "                ",
      "pfp": "",
      "username": "alice",
      "custom_css": ""
    },
    "marcheesed": {
      "password": "SabbyCabby",
      "is_admin": true,
      "bio": "<img src=\"https://file.garden/aBi0tvXzESnPXzr_/Amy.webp\"> marcy site maker yeah baby",
      "username": "marcheesed",
      "custom_css": "",
      "ip": "127.0.0.1",
      "pfp": "pfps/24eb4624ece272063af67d90396f54eb.jpg"
    }
  },
  "tags": ["Mature", "Violence", "Death", "M/M"],
  "fanfics": [
    {
      "id": 2,
      "title": "malec and damien au",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "shadowhunters",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": [],
      "chapters": [
        {
          "title": "i dont memberrrr",
          "content": "brooklyn, 2010\r\nthule\r\nmalec was loitering around the outside of a random book shop when she approached. \r\nhe instantly smiled at her, pushing himself up from the wall and holding out his hand. \r\nsava quickly took it, dragging herself closer to him. he knew he didn't need dark magic to enchant this girl, he could do it with his personality. that's what was special about her.\r\nwhen he told a joke, she'd laugh like no one else, and when he was upset she'd comfort him until everything felt alright.\r\nit was amazing, all they could hope was that everything would remain the same.\r\nbrooklyn, 2019\r\ndamien frowned upon seeing the bookshop. he'd never cared for books, and had no idea why he'd asked to meet here. but, he wanted to know a version of his father, even if it wasn't the one he once knew.\r\nhe brushed off his cape, thanking the angel raziel he was glamoured. if a mundane had seen his tough gear, herondale encrested cloak, and glowing stele, he would have been either called a cosplayer or called the police on. damien didnt like either.\r\nhe looked up at the glowing bright light infront of him, the passerbys simply walking by or around it, as a tall man stepped through. he wasnt that tall; only around 5'10, but still taller than damien. he snickered a bit at his confused expression, leaning back against the glass of the shop.\r\n'what? have you never seen a warlock show his mark before?'\r\nbut damien hadnt been looking at the foot tall antlers protruding from a mass of messy honey blonde hair, he'd been staring at malec's eyes, so much like his sisters that it was uncanny. he recoiled a bit, and whether it was from fear or distaste, even he couldnt say.\r\n'what? no, no. you just look like, well. you technically are him.' running his hand through his hair, damien sighed a little, 'my apologies for dragging you out here in such a fashion, but this isn't all pleasantries.'\r\nmalec raised a brow as his son from another world continued, 'we have reason to believe that lilith's son has returned, and is wreaking havoc with the ghosts of the damned.'\r\n'the ghosts of the damned?' malec inquired, knowing immediately who damien was referring to. he was, afterall, just trying to be civil."
        }
      ],
      "comments": [],
      "kudos": []
    },
    {
      "id": 3,
      "title": "coldsteel fic one",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Sonic The Hedgehog (Game)",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": ["F/M"],
      "chapters": [
        {
          "title": "I dont knowww dawg!",
          "content": "If there was a worse night to be outside, you wouldn't have known it. The thunder shook trees ten times your size almost to their core, rain pelting down at incredible speeds, and your body and fur is soaked to it's core, causing you to shiver inexplicably, and without any warning every few seconds. \r\nOf course, you knew you should be inside; that would be any reasonable person's first thought. However, when your \"home\" consisted of a cave that tended to flood easily.. you were out of luck when it come to torrential downpours such as today. Seeking refuge, you set out from your little hidden home in Green Hill towards a more mechanical zone; Metallic Madness. The actual place didn't even sound like a real zone, but it apparently existed given you were standing on it's grounds, slick with rain as you leaned back against a wall underneath a particularly large translucent pipe, finding a place to rest, atleast for now.\r\nYou sigh in relief, flicking your long tail and using the claws he had given you to wipe some of the water off; albeit, not much."
        }
      ],
      "comments": [],
      "kudos": []
    },
    {
      "id": 4,
      "title": "jason and karina fluff",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Twtstuck (Fandom)",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": ["F/M", "Toxic Hetslop"],
      "chapters": [
        {
          "title": "Oh my god i hate them",
          "content": "[JASON] ===> RETURN HOME AFTER A NIGHT OUT.\r\nYou open the door with a click and jangle of your KEYS, making a small disapproving noise as you notice the lit up hallway. It's about 2:34AM currently, nobody should be awake, yet you know who is. You hear her LAUGHTER from the other room, along with the sound of liquid pouring. She's slurring a little, clearly DRUNK, and the smell of hard liquor carries in the air.\r\nSomething is playing, a VOD from one of your streams, probably. You hear your own voice played back at you, though you can't pinpoint the one it's from. You're also too exhausted to question it further. Your boots clack against the wooden floor as you SLAM the front door and approach, not bothering to lock it behind you.\r\nJASON: Karina.\r\nJASON: It's-\r\nKARINA: Yeaah, yeah. It's- It's fuckin'. Yeah.\r\nJASON: ..\r\nJASON: Why are you up?\r\nKARINA: Cause!\r\nKARINA: Was fuckin'- waitin' for you, asshole.\r\nYou stare at her for a few moments. She's clearly annoyed, refusing to peel her eyes away from the TV. You shove her aside slightly, causing her to knock you back with an elbow - a common occurrence between you two, and almost a sign of affection at this point - sitting down next to her on the worn couch.\r\nJASON: Sorry.\r\nKARINA: ...\r\nKARINA: Whaatever.\r\nKARINA: I-I do the same-\r\nJASON: Yeah, but you tell me.\r\nJASON: Hell, you give me fucking, hourly updates!\r\nKARINA: I-I can stop if you want me to!\r\nShe sits up instantly, looking over at you with some semblance of fear in her eyes. You grimace at the reaction, causing her to look away with a guilty expression. Old habits die hard on both sides, you guess.\r\nJASON: No, no- You- I like it.\r\nKARINA: What?\r\nJASON: I like it.\r\nShe stares at you, dumbfounded by your rare expression of EMOTION. So you continue.\r\nJASON: I-I don't know, you know the game made me- us. Paranoid.\r\nJASON: Sometimes, well, okay, alot, it's good to know you're. You know.\r\nJASON: Still alive.\r\nJASON: Not-\r\nKARINA: Yeah, I-I get it.\r\nKARINA: I-I mean that's why I'm so-\r\nJASON: Yeah.\r\nJASON: I-I'm sorry, Kar.\r\nJASON: You know I just get-\r\nKARINA: I knoww! I knowww- but-\r\nJASON: Yeah.\r\nJASON: Love you?\r\nKARINA: Hahaa..\r\nKARINA: I love you too, i-idiot.\r\nShe falls back against you, picking up the remote lazily and handing it to you, causing you to promptly switch it to literally anything else. Thankfully, she knows how much you hate watching your own streams.\r\nShe knows almost everything about you."
        }
      ],
      "comments": [],
      "kudos": []
    },
    {
      "id": 5,
      "title": "jazz and jas thing",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Twtstuck (Fandom)",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": ["Siblings"],
      "chapters": [
        {
          "title": "stupid chuds",
          "content": "-- wifeBeater [WB] began pestering maleWife [MW] at 6:23AM! --\r\nMW: Are you going to say anything??\r\nWB: look dude i said im srry\r\nMW: Yes, but you did it in that way!\r\nWB: can we not do this over txt\r\nMW: How else would you rather do it???\r\nMW: In person?? Because that isn't much of an option right now, Jas!\r\nMW: Not while we're fucking- literally on different planets!\r\nWB: ok but if u woudl just LISTEN i swear\r\nWB: u just need 2 sleep\r\nMW: Jas!! Really!! You need to stop being so lazy!!!\r\nWB: listen 2 me for once jesus chris tim not fuckin with u j\r\nMW: Uh huh.\r\nMW: And I should trust you.. why??\r\nMW: You've done nothing but fuck with me our entire lives, Jas!!!\r\nMW: I didn't do shit to you!\r\nWB: look- j- im srry i said\r\nWB: i dont think words can express how srry i am\r\nWB: ok\r\nWB: but\r\nWB: plz\r\nWB: u dont listen 2 me often\r\nWB: i know u dont\r\nWB: but this 1nce i swear im not fckin with u wahts the worst thatll happen if u sleep\r\nMW: I don't know- Imps invade my base??\r\nMW: I get my shit stolen- again- and I have to go back to that nice village full of fox people, who, while very generous, I don't want to bother too much!!!\r\nWB: christ yr 2 kind 4 this wurld\r\nWB: waht can i do 2 convince u\r\nMW: I don't know.\r\nMW: Prove it.\r\nWB:\r\nWB: u can still see me on taht device rite\r\nMW: You mean.. my laptop.\r\nWB: yea yea wahtever\r\nMW: Yes, Jas. I'm your server player.\r\nMW: Fuck, they're the reason we had you send out those drones!\r\nWB: o rite ya\r\nWB: ok ok\r\nWB: so youll b able 2 see if im sleepin rite\r\nMW: ..Well, yeah.\r\nWB: ok watch this then\r\n-- wifeBeater [WB] has gone idle! --\r\nYou minimize the pesterlog to stare at the live feed of your TWIN SISTER, who is tapping the lens repeatedly with a chipped fingernail. Once she realizes it's active, she steps back with a toothy grin, falling back onto her own makeshift bed.\r\nYour name is JAZZ STRIDER, and you're in the middle of a SBURB SESSION. A possibly fucked one, at that, and you don't like to swear! You have various interests- but they really, really aren't important right now. All you care about is making sure everybody gets to this new world or whatever Jas is fumbling on about- although she does seem to know an awful lot more than usual about this particular thing, almost like she's prepared- SAFE and SOUND!\r\nYou're currently on LOMAL (The Land of Metal and Lights!) which, really is quite pretty if you do have to say so yourself- much like the name implies, is quite the LIGHTSHOW. The sky is a constant dark purple, allowing the yellow-green-blue hues to shine against the background even brighter. The ground consists of, you guessed it, an almost unnaturally jarring metal structures, placed at strange and almost eerie angles, a vast ABYSS awaiting below the miles and miles of shiny tresses, platforms and towering buildings.\r\nYou focus your attention back to JAS, your aforementioned sister, who has.. now seemingly passed out on her bed. You groan loudly, preparing to close the feed overall, and then-\r\n-- wifeBeater [WB] has begun pestering maleWife [MW] at 7:01AM! --\r\nWB: that proof enuf 4 u\r\nMW:\r\nMW:\r\nMW: HOW DID YOU DO THAT?!\r\nWB: do waht\r\nMW: YOU.\r\nMW: YOU'RE ASLEEP!!\r\nWB: ya but not on prospit lol\r\nMW:\r\nMW:\r\nMW: YOU'RE FUCKING KIDDING ME.\r\nWB: dude i told u 4 ytears it was real!\r\nWB: YR the one that never beliueved me\r\nWB: THE WHOLE 'JASSS its just a dreaaam frum when we were kids cmon stuff'\r\nMW: Oh my god..\r\nMW: So that means..?\r\nWB: YEAH IM USULLY RITE LMAO ATLEST ABT THIS STUFF JAZZ\r\nWB:\r\nWB: srry for yelling,. you get my pouint though right????\r\nMW: Yeah. Yeah- I-I fucking get it! I'd be.. Yeah.\r\nMW: I'd be annoyed too, I'm.\r\nWB: DO NOT SAY U R SRRY\r\nWB: ITS A MISUNDERSTANDING ITS COMMON ITS FINE JEEEZUUUSS\r\nWB: PLUS its a whole thing i doubt you even were able 2 know before this lol\r\nMW: Okay.\r\nMW: Okay.\r\nMW: So if I just sleep-\r\nWB: you'll end up on derse\r\nMW: Right.\r\nWB: we'll have 2 meet since yk\r\nMW: Yeah.\r\nMW: Where?\r\nWB: halfway ig\r\nMW: Just- out in space???\r\nWB: do u have any better ideas coz liek i cant go 2 derse u cant go to prospit rememebr\r\nWB: liek if u do have any brighter ideas plz j\r\nWB: indulge me\r\nMW:\r\nMW: Fair point!\r\nMW: Alright.\r\nMW: I-I guess I'll.\r\nWB: ill see u in a bit\r\nWB: we'll talk this out face 2 face\r\nMW: Alright.\r\nMW: See you.\r\nWB: bye\r\n-- maleWife [MW] ceased pestering wifeBeater [WB] at 7:34AM! --\r\nYou close your laptop with a click, putting it onto charge with the POWERBANK beside you.\r\nYou FEEL stressed as fuck, and are somewhat still in DISBELIEF. Your sister and you had once dreamed of Prospit and Derse, talked about each kingdom to concerning lengths at the dinner table (much to your parents' delight) but to believe they were actually REAL was a whole other level- hell, your head felt dizzy from the KNOWLEDGE!\r\nFalling asleep will be easy at this rate, maybe even a welcome relief if she is just going on about utter bullshit yet again. You wearily, and very cautiously flick the small light above you that you had set up a month prior off, settling into the cot you've been sitting in the entire time.\r\nAnd, without any effort, just like predicted you...\r\n..\r\n.\r\nJolt up in an eeriely familiar, yellow tinted bedroom.\r\nJAZZ: What the..\r\nYou look over at the identical, still CAT-COVERED bed a few feet away; empty. You don't know what you expected, it was always empty, but. For some reason, something felt very, very wrong about that. You slowly flick the sheets off of you and clamber out of the bed, swaying side to side as you do.\r\nYour legs feel.. weak, painful, the way they would if you haven't used them for a while. Your nose scrunches up in discomfort, but you don't express it any other way. Looking out the open, nearby window leads you to a vast sight; the whole of Derse in all its amethyst hues and violet glory; black-carapaced citizens lining the streets"
        }
      ],
      "comments": [],
      "kudos": []
    },
    {
      "id": 6,
      "title": "test",
      "author": "pastrychan",
      "owner": "pastrychan",
      "fandom": "awd",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": ["BL"],
      "chapters": [{ "title": "awdawd", "content": "awdwad" }],
      "comments": [],
      "kudos": []
    },
    {
      "id": 7,
      "title": "test",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "test",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": [],
      "chapters": [{ "title": "test", "content": "test" }],
      "comments": [],
      "kudos": []
    },
    {
      "id": 8,
      "title": "test",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "test",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": [],
      "chapters": [{ "title": "test", "content": "test" }],
      "comments": [],
      "kudos": []
    },
    {
      "id": 9,
      "title": "test",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "test",
      "stats": { "words": 0, "chapters": 1, "kudos": 0 },
      "tags": [],
      "chapters": [
        { "title": "test", "content": "wdawd awdaw   eeeeeee sficlceeeeeeee" }
      ],
      "comments": [
        { "name": "marcheesey", "content": "FUCK YOU" },
        { "name": "marcheesey", "content": "wow thats kinda mean :?" },
        { "name": "marcheesey", "content": "i know right" }
      ],
      "kudos": ["marcheesey"]
    }
  ],
  "notes": {
    "1": "hello i am a note\r\napple from annoying orange: I LOVE TRANS PEOPLE",
    "2": "whos jack! cAN I FIGHT HIM",
    "3": "pagnation for index should only show 10\r\ncomments dont update with username\r\ncomments need to have timestamps and be able to be deleted by users and admins\r\ntags in index fics + filtering for them"
  }
}
