{
  "users": {
    "alice": {
      "password": "$2b$12$.D1TUj8JOA8UWsYC0prHaO23hSef3IpwlmXD4vFP.cWltFMg3ujqG",
      "is_admin": false,
      "bio": "                ",
      "pfp": "",
      "username": "alice",
      "custom_css": ""
    },
    "pastrychan": {
      "password": "$2b$12$WsreIpbX4cuMikdEd3SpTOjeS3fsIzrKQ4n9LbrPg6SDm.QbTeySG",
      "is_admin": false,
      "bio": "Fangirl and fanfic writer!!!!",
      "username": "pastrychan",
      "pfp": "pfps/4d9276b2eabb191d70be71872ea5d0d7.webp",
      "custom_css": "",
      "ip_logs": [
        {
          "timestamp": "2024-04-27T12:34:56",
          "page": "/some/page",
          "ip": "192.168.1.5"
        }
      ]
    },
    "marcheesed": {
      "password": "$2b$12$DD/BPxH6nHoNZd49b25EdelgSYFpwLLUhoDir0s5zkwwutGB94SMO",
      "is_admin": true,
      "bio": "<img src=\"https://file.garden/aBi0tvXzESnPXzr_/Amy.webp\">site maker yeah baby",
      "username": "marcheesed",
      "custom_css": "",
      "pfp": "pfps/24eb4624ece272063af67d90396f54eb.jpg",
      "ip_logs": [
        {
          "timestamp": "2024-04-27T12:34:56",
          "page": "/some/page",
          "ip": "192.168.1.5"
        }
      ],
      "display_name": "Mod Marcy"
    },
    "bobby": {
      "password": "$2b$12$.TgyPYTmDOnuKv/WgjLov.o4UHz5JjNNzx9CGP/v4IlWCWA0lW1gK",
      "is_admin": false,
      "bio": "aawdwdwad",
      "ip": "127.0.0.1",
      "username": "bobby",
      "custom_css": ""
    },
    "testaccount": {
      "password": "$2b$12$QPOnud4Vyw4vUHqqCod7Xepja4uFSdjYvxWG19TkMgxtNueeE4Yai",
      "is_admin": false,
      "bio": "",
      "ip": "127.0.0.1"
    }
  },
  "tags": [
    "Toxic Hetslop",
    "Physical Abuse",
    "BL",
    "Siblings",
    "Robot",
    "F/M",
    "Emotional Abuse",
    "Mechanical",
    "M/M"
  ],
  "fanfics": [
    {
      "id": 2,
      "title": "malec and damien au",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "shadowhunters",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [],
      "chapters": [
        {
          "title": "i dont memberrrr",
          "content": "brooklyn, 2010\r\nthule\r\nmalec was loitering around the outside of a random book shop when she approached. \r\nhe instantly smiled at her, pushing himself up from the wall and holding out his hand. \r\nsava quickly took it, dragging herself closer to him. he knew he didn't need dark magic to enchant this girl, he could do it with his personality. that's what was special about her.\r\nwhen he told a joke, she'd laugh like no one else, and when he was upset she'd comfort him until everything felt alright.\r\nit was amazing, all they could hope was that everything would remain the same.\r\nbrooklyn, 2019\r\ndamien frowned upon seeing the bookshop. he'd never cared for books, and had no idea why he'd asked to meet here. but, he wanted to know a version of his father, even if it wasn't the one he once knew.\r\nhe brushed off his cape, thanking the angel raziel he was glamoured. if a mundane had seen his tough gear, herondale encrested cloak, and glowing stele, he would have been either called a cosplayer or called the police on. damien didnt like either.\r\nhe looked up at the glowing bright light infront of him, the passerbys simply walking by or around it, as a tall man stepped through. he wasnt that tall; only around 5'10, but still taller than damien. he snickered a bit at his confused expression, leaning back against the glass of the shop.\r\n'what? have you never seen a warlock show his mark before?'\r\nbut damien hadnt been looking at the foot tall antlers protruding from a mass of messy honey blonde hair, he'd been staring at malec's eyes, so much like his sisters that it was uncanny. he recoiled a bit, and whether it was from fear or distaste, even he couldnt say.\r\n'what? no, no. you just look like, well. you technically are him.' running his hand through his hair, damien sighed a little, 'my apologies for dragging you out here in such a fashion, but this isn't all pleasantries.'\r\nmalec raised a brow as his son from another world continued, 'we have reason to believe that lilith's son has returned, and is wreaking havoc with the ghosts of the damned.'\r\n'the ghosts of the damned?' malec inquired, knowing immediately who damien was referring to. he was, afterall, just trying to be civil."
        }
      ],
      "comments": [],
      "kudos": [
        "marcheesed",
        "pastrychan"
      ],
      "age_rating": "13+"
    },
    {
      "id": 3,
      "title": "coldsteel fic one",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Sonic The Hedgehog (Game)",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "F/M"
      ],
      "chapters": [
        {
          "title": "I dont knowww dawg!",
          "content": "If there was a worse night to be outside, you wouldn't have known it. The thunder shook trees ten times your size almost to their core, rain pelting down at incredible speeds, and your body and fur is soaked to it's core, causing you to shiver inexplicably, and without any warning every few seconds. \r\nOf course, you knew you should be inside; that would be any reasonable person's first thought. However, when your \"home\" consisted of a cave that tended to flood easily.. you were out of luck when it come to torrential downpours such as today. Seeking refuge, you set out from your little hidden home in Green Hill towards a more mechanical zone; Metallic Madness. The actual place didn't even sound like a real zone, but it apparently existed given you were standing on it's grounds, slick with rain as you leaned back against a wall underneath a particularly large translucent pipe, finding a place to rest, atleast for now.\r\nYou sigh in relief, flicking your long tail and using the claws he had given you to wipe some of the water off; albeit, not much."
        }
      ],
      "comments": [],
      "kudos": [
        "marcheesed",
        "pastrychan"
      ],
      "age_rating": "16+"
    },
    {
      "id": 4,
      "title": "jason and karina fluff",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Twtstuck (Fandom)",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "Toxic Hetslop",
        "F/M"
      ],
      "chapters": [
        {
          "title": "Oh my god i hate them",
          "content": "[JASON] ===> RETURN HOME AFTER A NIGHT OUT.\r\nYou open the door with a click and jangle of your KEYS, making a small disapproving noise as you notice the lit up hallway. It's about 2:34AM currently, nobody should be awake, yet you know who is. You hear her LAUGHTER from the other room, along with the sound of liquid pouring. She's slurring a little, clearly DRUNK, and the smell of hard liquor carries in the air.\r\nSomething is playing, a VOD from one of your streams, probably. You hear your own voice played back at you, though you can't pinpoint the one it's from. You're also too exhausted to question it further. Your boots clack against the wooden floor as you SLAM the front door and approach, not bothering to lock it behind you.\r\nJASON: Karina.\r\nJASON: It's-\r\nKARINA: Yeaah, yeah. It's- It's fuckin'. Yeah.\r\nJASON: ..\r\nJASON: Why are you up?\r\nKARINA: Cause!\r\nKARINA: Was fuckin'- waitin' for you, asshole.\r\nYou stare at her for a few moments. She's clearly annoyed, refusing to peel her eyes away from the TV. You shove her aside slightly, causing her to knock you back with an elbow - a common occurrence between you two, and almost a sign of affection at this point - sitting down next to her on the worn couch.\r\nJASON: Sorry.\r\nKARINA: ...\r\nKARINA: Whaatever.\r\nKARINA: I-I do the same-\r\nJASON: Yeah, but you tell me.\r\nJASON: Hell, you give me fucking, hourly updates!\r\nKARINA: I-I can stop if you want me to!\r\nShe sits up instantly, looking over at you with some semblance of fear in her eyes. You grimace at the reaction, causing her to look away with a guilty expression. Old habits die hard on both sides, you guess.\r\nJASON: No, no- You- I like it.\r\nKARINA: What?\r\nJASON: I like it.\r\nShe stares at you, dumbfounded by your rare expression of EMOTION. So you continue.\r\nJASON: I-I don't know, you know the game made me- us. Paranoid.\r\nJASON: Sometimes, well, okay, alot, it's good to know you're. You know.\r\nJASON: Still alive.\r\nJASON: Not-\r\nKARINA: Yeah, I-I get it.\r\nKARINA: I-I mean that's why I'm so-\r\nJASON: Yeah.\r\nJASON: I-I'm sorry, Kar.\r\nJASON: You know I just get-\r\nKARINA: I knoww! I knowww- but-\r\nJASON: Yeah.\r\nJASON: Love you?\r\nKARINA: Hahaa..\r\nKARINA: I love you too, i-idiot.\r\nShe falls back against you, picking up the remote lazily and handing it to you, causing you to promptly switch it to literally anything else. Thankfully, she knows how much you hate watching your own streams.\r\nShe knows almost everything about you."
        }
      ],
      "comments": [
        {
          "name": "marcheesed",
          "content": "im a comment!",
          "timestamp": "2025-10-24 17:02:44",
          "pfp": "pfps/24eb4624ece272063af67d90396f54eb.jpg",
          "user": {
            "password": "SabbyCabby",
            "is_admin": true,
            "bio": "<img src=\"https://file.garden/aBi0tvXzESnPXzr_/Amy.webp\">site maker yeah baby",
            "username": "marcheesed",
            "custom_css": "",
            "pfp": "pfps/24eb4624ece272063af67d90396f54eb.jpg",
            "ip_logs": [
              {
                "timestamp": "2024-04-27T12:34:56",
                "page": "/some/page",
                "ip": "192.168.1.5"
              }
            ]
          }
        },
        {
          "name": "bobby",
          "content": "wtf",
          "timestamp": "2025-10-24 17:27:12",
          "pfp": "",
          "user": {
            "password": "monster",
            "is_admin": false,
            "bio": "aawdwdwad",
            "ip": "127.0.0.1",
            "username": "bobby",
            "custom_css": ""
          }
        }
      ],
      "kudos": [
        "pastrychan",
        "bobby",
        "marcheesed"
      ],
      "age_rating": "18+"
    },
    {
      "id": 5,
      "title": "jazz and jas thing",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Twtstuck (Fandom)",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "Siblings"
      ],
      "chapters": [
        {
          "title": "stupid chuds",
          "content": "-- wifeBeater [WB] began pestering maleWife [MW] at 6:23AM! --\r\nMW: Are you going to say anything??\r\nWB: look dude i said im srry\r\nMW: Yes, but you did it in that way!\r\nWB: can we not do this over txt\r\nMW: How else would you rather do it???\r\nMW: In person?? Because that isn't much of an option right now, Jas!\r\nMW: Not while we're fucking- literally on different planets!\r\nWB: ok but if u woudl just LISTEN i swear\r\nWB: u just need 2 sleep\r\nMW: Jas!! Really!! You need to stop being so lazy!!!\r\nWB: listen 2 me for once jesus chris tim not fuckin with u j\r\nMW: Uh huh.\r\nMW: And I should trust you.. why??\r\nMW: You've done nothing but fuck with me our entire lives, Jas!!!\r\nMW: I didn't do shit to you!\r\nWB: look- j- im srry i said\r\nWB: i dont think words can express how srry i am\r\nWB: ok\r\nWB: but\r\nWB: plz\r\nWB: u dont listen 2 me often\r\nWB: i know u dont\r\nWB: but this 1nce i swear im not fckin with u wahts the worst thatll happen if u sleep\r\nMW: I don't know- Imps invade my base??\r\nMW: I get my shit stolen- again- and I have to go back to that nice village full of fox people, who, while very generous, I don't want to bother too much!!!\r\nWB: christ yr 2 kind 4 this wurld\r\nWB: waht can i do 2 convince u\r\nMW: I don't know.\r\nMW: Prove it.\r\nWB:\r\nWB: u can still see me on taht device rite\r\nMW: You mean.. my laptop.\r\nWB: yea yea wahtever\r\nMW: Yes, Jas. I'm your server player.\r\nMW: Fuck, they're the reason we had you send out those drones!\r\nWB: o rite ya\r\nWB: ok ok\r\nWB: so youll b able 2 see if im sleepin rite\r\nMW: ..Well, yeah.\r\nWB: ok watch this then\r\n-- wifeBeater [WB] has gone idle! --\r\nYou minimize the pesterlog to stare at the live feed of your TWIN SISTER, who is tapping the lens repeatedly with a chipped fingernail. Once she realizes it's active, she steps back with a toothy grin, falling back onto her own makeshift bed.\r\nYour name is JAZZ STRIDER, and you're in the middle of a SBURB SESSION. A possibly fucked one, at that, and you don't like to swear! You have various interests- but they really, really aren't important right now. All you care about is making sure everybody gets to this new world or whatever Jas is fumbling on about- although she does seem to know an awful lot more than usual about this particular thing, almost like she's prepared- SAFE and SOUND!\r\nYou're currently on LOMAL (The Land of Metal and Lights!) which, really is quite pretty if you do have to say so yourself- much like the name implies, is quite the LIGHTSHOW. The sky is a constant dark purple, allowing the yellow-green-blue hues to shine against the background even brighter. The ground consists of, you guessed it, an almost unnaturally jarring metal structures, placed at strange and almost eerie angles, a vast ABYSS awaiting below the miles and miles of shiny tresses, platforms and towering buildings.\r\nYou focus your attention back to JAS, your aforementioned sister, who has.. now seemingly passed out on her bed. You groan loudly, preparing to close the feed overall, and then-\r\n-- wifeBeater [WB] has begun pestering maleWife [MW] at 7:01AM! --\r\nWB: that proof enuf 4 u\r\nMW:\r\nMW:\r\nMW: HOW DID YOU DO THAT?!\r\nWB: do waht\r\nMW: YOU.\r\nMW: YOU'RE ASLEEP!!\r\nWB: ya but not on prospit lol\r\nMW:\r\nMW:\r\nMW: YOU'RE FUCKING KIDDING ME.\r\nWB: dude i told u 4 ytears it was real!\r\nWB: YR the one that never beliueved me\r\nWB: THE WHOLE 'JASSS its just a dreaaam frum when we were kids cmon stuff'\r\nMW: Oh my god..\r\nMW: So that means..?\r\nWB: YEAH IM USULLY RITE LMAO ATLEST ABT THIS STUFF JAZZ\r\nWB:\r\nWB: srry for yelling,. you get my pouint though right????\r\nMW: Yeah. Yeah- I-I fucking get it! I'd be.. Yeah.\r\nMW: I'd be annoyed too, I'm.\r\nWB: DO NOT SAY U R SRRY\r\nWB: ITS A MISUNDERSTANDING ITS COMMON ITS FINE JEEEZUUUSS\r\nWB: PLUS its a whole thing i doubt you even were able 2 know before this lol\r\nMW: Okay.\r\nMW: Okay.\r\nMW: So if I just sleep-\r\nWB: you'll end up on derse\r\nMW: Right.\r\nWB: we'll have 2 meet since yk\r\nMW: Yeah.\r\nMW: Where?\r\nWB: halfway ig\r\nMW: Just- out in space???\r\nWB: do u have any better ideas coz liek i cant go 2 derse u cant go to prospit rememebr\r\nWB: liek if u do have any brighter ideas plz j\r\nWB: indulge me\r\nMW:\r\nMW: Fair point!\r\nMW: Alright.\r\nMW: I-I guess I'll.\r\nWB: ill see u in a bit\r\nWB: we'll talk this out face 2 face\r\nMW: Alright.\r\nMW: See you.\r\nWB: bye\r\n-- maleWife [MW] ceased pestering wifeBeater [WB] at 7:34AM! --\r\nYou close your laptop with a click, putting it onto charge with the POWERBANK beside you.\r\nYou FEEL stressed as fuck, and are somewhat still in DISBELIEF. Your sister and you had once dreamed of Prospit and Derse, talked about each kingdom to concerning lengths at the dinner table (much to your parents' delight) but to believe they were actually REAL was a whole other level- hell, your head felt dizzy from the KNOWLEDGE!\r\nFalling asleep will be easy at this rate, maybe even a welcome relief if she is just going on about utter bullshit yet again. You wearily, and very cautiously flick the small light above you that you had set up a month prior off, settling into the cot you've been sitting in the entire time.\r\nAnd, without any effort, just like predicted you...\r\n..\r\n.\r\nJolt up in an eeriely familiar, yellow tinted bedroom.\r\nJAZZ: What the..\r\nYou look over at the identical, still CAT-COVERED bed a few feet away; empty. You don't know what you expected, it was always empty, but. For some reason, something felt very, very wrong about that. You slowly flick the sheets off of you and clamber out of the bed, swaying side to side as you do.\r\nYour legs feel.. weak, painful, the way they would if you haven't used them for a while. Your nose scrunches up in discomfort, but you don't express it any other way. Looking out the open, nearby window leads you to a vast sight; the whole of Derse in all its amethyst hues and violet glory; black-carapaced citizens lining the streets"
        }
      ],
      "comments": [],
      "kudos": [],
      "age_rating": "16+"
    },
    {
      "id": 6,
      "title": "test",
      "author": "pastrychan",
      "owner": "pastrychan",
      "fandom": "awd",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "BL"
      ],
      "chapters": [
        {
          "title": "awdawd",
          "content": "awdwad"
        }
      ],
      "comments": [],
      "kudos": []
    },
    {
      "id": 10,
      "title": "coldsteel neo fic",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Sonic The Hedgehog (Game)",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "F/M",
        "Physical Abuse",
        "Toxic Hetslop",
        "Mechanical"
      ],
      "chapters": [
        {
          "title": "i havent read this in so long",
          "content": "You don’t believe your eyes at first. But the eyes are the same, piercing your soul. It takes you a long moment to move, and just when you open your mouth to speak, you’re surprised that the first noise made doesn’t come from you.. But him.\r\n“..What are you doing here. I made it clear that I wanted you to stay back at the base.”\r\nHis voice shakes you to your core, cold and mechanical. Just like him. The sentence takes the blue blur and his friends by surprise, noticing Metal’s lack of attention towards them. It makes you sick, but all eyes are on you now. \r\nAmy is the first to speak, “Gloom? What are you doing here?! You know it’s not safe!”\r\nHer insisting innocence makes the pit in your stomach fall even more. You don’t respond to her, instead electing to take a step towards Metal, with only an answer for him, your voice shaky.\r\n“Since when do I listen to you..?”\r\nHe can only look over at the onlookers in response, attacks on both sides seemingly halted as Sonic looks between you two, confusion riddling his face. \r\nYou won’t be the first to break it to him, you can’t- but. Metal, with his new found voice, seemingly doesn’t have your restrictions.\r\n“Are you confused, hedgehog? Wondering why one of your so-called allies is seemingly an exception to my rule?”\r\nHis two-tailed fox friend has seemingly already put the pieces together, given the look of betrayal on his face, which isn’t all that surprising to you.. Though, you can’t say you were close with him.\r\n“Sonic!” He cries out, in his obnoxious tone, “She’s.. She’s working with Metal!”\r\nAnd the mechanical laughter fills the air, that voice again making your heart beat against your chest. Yet, your feet lead you toward him, until you’re by his side, his hand on your shoulder, and your eyes directed towards them.\r\n“Yes, fox. She is. And has been for quite some time, unbeknownst to you and your group.”\r\nIt takes a heavy toll among the group, somewhat to your surprise. The betrayed look is now shared, and it makes you move closer to the mechanical hedgehog by your side. He continues to speak, to your surprise. Though, you’ve always imagined him to be more of the silent type.. It appears this version of him- if it truly is him- isn’t such the case.\r\n“I’m surprised you seem to care so much about this little experiment. You are all aware of her past. Even the shoes she continues to wear signifies her allegiance to us- Whether you noticed or not, she has been against you this entire time, hedgehog. Who knows how many more of your allies are as well?”\r\nYou try to tune out his mocking words, knowing it’s all for play, yet your eyes eventually avert up to him, just to see the glowing red ones meeting yours. \r\nSonic’s irritating voice interrupts the moment though.\r\n“Hah! As if I’d ever believe somethin’ like that-”\r\nHis gaunty lines are cut off by a loud whirring, one you’d recognize all too well. You step even closer to Metal, as he picks you up with one arm, a procedure you’re both too familiar with at this point. Though, his changed stature makes it somewhat strange to you, making sure to hold onto his chest as you both raise up from the ground, the heat of his jets propelling you both upwards.\r\nAs you expect another spiteful remark, only his laughter fills your ears, pulling you closer to the now heating sheening surface. The yells of the ones below slowly fade out, as you both soar upwards towards the sky.\r\nHis laughter stops too, the only noise being that of his jets propelling you both forward. An uneasy silence then plays out for an equally uneasy amount of time.. And yet you still aren’t the first to break that.\r\n“Why did you follow me?”\r\nHis voice is hard to describe, and the fact he doesn’t look at you while soaring through the air doesn’t help you pinpoint his emotional state.\r\n“Wh- Why do you think?? I hear that Sonic and his gang are after you, and there’s some haywire about one of the Emeralds being missing- plus, you just not being all that.. Honest with me, Metal!”\r\nThe laughter returns, making your heart thump even louder. You press the side of your head against his chest, muffling the sound with the ones of his jet engines.\r\n“And I have told you to not worry about me, or compromise your position, as you so foolishly just did.”\r\nYou fall silent once again, something he notices as he looks over with those eyes.\r\n“You dislike this form.”\r\nIt results in a scoff from you, as well as a glare."
        }
      ],
      "comments": [],
      "kudos": [
        "marcheesed",
        "pastrychan"
      ],
      "age_rating": "18+"
    },
    {
      "id": 11,
      "title": "test",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "test",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "Robot"
      ],
      "chapters": [
        {
          "title": "testt",
          "content": "test neo gay faggot"
        }
      ],
      "comments": [
        {
          "name": "marcheesed",
          "content": "adwd",
          "timestamp": "2025-10-24 15:34:10",
          "pfp": "pfps/24eb4624ece272063af67d90396f54eb.jpg",
          "user": {
            "password": "SabbyCabby",
            "is_admin": true,
            "bio": "<img src=\"https://file.garden/aBi0tvXzESnPXzr_/Amy.webp\">site maker yeah baby",
            "username": "marcheeseded",
            "custom_css": "",
            "pfp": "pfps/24eb4624ece272063af67d90396f54eb.jpg",
            "ip_logs": [
              {
                "timestamp": "2024-04-27T12:34:56",
                "page": "/some/page",
                "ip": "192.168.1.5"
              }
            ]
          }
        }
      ],
      "kudos": [
        "marcheesed"
      ],
      "age_rating": "13+"
    },
    {
      "id": 12,
      "title": "test for pagnation",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Forsaken (Game)",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "M/M"
      ],
      "chapters": [
        {
          "title": "test",
          "content": "hello"
        }
      ],
      "comments": [],
      "kudos": [],
      "age_rating": "13+"
    },
    {
      "id": 13,
      "title": "helloo",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "Forsaken (Game)",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [
        "Emotional Abuse"
      ],
      "age_rating": "18+",
      "chapters": [
        {
          "title": "test",
          "content": "awd"
        }
      ],
      "comments": [],
      "kudos": []
    },
    {
      "id": 14,
      "title": "eee",
      "author": "marcheesed",
      "owner": "marcheesed",
      "fandom": "ee",
      "stats": {
        "words": 0,
        "chapters": 1,
        "kudos": 0
      },
      "tags": [],
      "age_rating": "18+",
      "chapters": [
        {
          "title": "eee",
          "content": "ee"
        }
      ],
      "comments": [],
      "kudos": []
    }
  ],
  "notes": {
    "1": {
      "owner": "marcheesed",
      "content": "hello i am a note\r\napple from annoying orange: I LOVE TRANS PEOPLE"
    },
    "3": {
      "owner": "marcheesed",
      "content": "privacy policy, terms of service\n\noverall stats (kudos and fics)\nexclusion feature (mandatory) (will likely take the longest here aside from sql)\n\nthings after all features are added (mostly)\nmove entire database to sql therefore making mostly prod ready!!\nfind admins? after the sql though so i can 100% say sites prod ready\n"
    },
    "4": {
      "owner": "pastrychan",
      "content": "this is a pastrychan note"
    },
    "5": {
      "owner": "marcheesed",
      "content": "content\nFINALLYAW DADAWD A"
    },
    "6": {
      "owner": "marcheesed",
      "content": "<b>RIVAL INTERACTIONS</b>\n\nCLASSIC GLOOM (mobian)\n\nRIVAL\n\nMETAL SONIC: ....!\n\nGLOOM: idk yet\n\n---\n\nGLOOM: I finally caught up to you! And I'll go even further than you in this race- just you wait!\n\nMETAL SONIC: !!\n\nITEM HIT\n\nGLOOM: Sorry about that, but I'll see you at the finish line!\n\nMETAL SONIC: ...!!\n\nPLAYER HIT\n\nMETAL SONIC: ...!\n\nGLOOM: Metal!.. I'll get you back!\n\n\nRIVAL LOSE\n\nROUND 1 -\n\nGLOOM: Ohhh no, no no! I can't fall behind yet!\n\nGLOOM: Umm, haha! Well, there's always next race!\n\nROUND 3 -\n\nGLOOM: Aah- I can't lose now! You'll see, I'll turn this race around in my favor!\n\nGLOOM: Y-You know, using your turbines is against the rules, right?\n\nPLAYER WIN -\n\nGLOOM: At least I gave it my best shot..!\n\nGLOOM: I lost?! Awww... no!\n\nRIVAL WIN\n\nROUND 1 -\n\nGLOOM: And that's how it's done!\n\nGLOOM: Woohoo! And onto the next!\n\nROUND 3 -\n\nGLOOM: You know, I expected this to be more of a challenge.. Are you sure you're performing at optimal efficiency?\n\nGLOOM: Earth to Metal! Maybe you're just faster out of vehicles?\n\n\nMODERN GLOOM (robot)\n\n"
    }
  },
  "blog_posts": {
    "1": {
      "title": "test",
      "content": "hello this is the first site test\r\nhello hahaha",
      "author": "marcheesed",
      "timestamp": "2025-10-21T14:20:08.082394"
    },
    "2": {
      "title": "test two",
      "content": "testing date and time",
      "author": "marcheesed",
      "timestamp": "2025-10-21T14:20:23.202983"
    },
    "3": {
      "title": "test three",
      "content": "testing date and time again but specifically also character limits when published to index.. current slice is at 150 with an overflow of y due to problems with the set height of the container site updates are kept in + alot of bug fixes to editing blog posts and notes",
      "author": "marcheesed",
      "timestamp": "2025-10-24T08:54:56.054453"
    },
    "4": {
      "title": "Lots of updates!",
      "content": "ip logging and audit logs for everybody and each individual user live, reworked kudos, comments, profiles, added admin display names, set up the discord server slightly, added sanitized html to notes, all known issues with username changes have mostly been fixed, added age ratings, added fandoms on the index fics, added a new search feature",
      "author": "Mod Marcy",
      "timestamp": "2025-10-24T18:31:39.910595"
    }
  },
  "site_info": {
    "title": "Info",
    "content": "Welcome to kawfee.net!\r\nWe are a fanfiction hosting/archival website with strict moderation in terms of darker themes and disturbing content.\r\nBasically proshippers get out this isnt the final bio i cant fucking say that fuck my baka life"
  },
  "ip_logs": [
    {
      "ip": "127.0.0.1",
      "timestamp": "2025-10-24T10:15:27.921366"
    },
    {
      "ip": "127.0.0.1",
      "timestamp": "2025-10-24T10:24:00.854344",
      "user": "marcheesed",
      "page": "/"
    },
    {
      "ip": "127.0.0.1",
      "timestamp": "2025-10-24T12:39:21.177078",
      "user": null,
      "page": "/"
    },
    {
      "ip": "127.0.0.1",
      "timestamp": "2025-10-24T12:41:56.828123",
      "user": "marcheesed",
      "page": "/"
    }
  ],
  "user_logs": {
    "marcheesed": [
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T14:19:56.322790",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T15:32:19.294357",
        "page": "/profile"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T19:04:33.413187",
        "page": "/profile"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T19:21:18.566900",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T20:03:18.045012",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-25T19:47:08.026997",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T00:00:19.806095",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T00:43:11.997441",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T04:18:27.880403",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T19:31:40.093181",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T20:09:44.871195",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T20:59:40.291269",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T21:53:07.320262",
        "page": "/admin"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T22:17:56.275410",
        "page": "/profile"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T23:13:49.841822",
        "page": "/profile"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-29T23:55:54.812280",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-30T00:10:55.493145",
        "page": "/profile"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-30T01:06:51.743179",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-30T20:07:43.638290",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-30T20:20:54.000434",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-01T00:25:14.511832",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-01T00:48:41.197127",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-01T02:21:32.205708",
        "page": "/notes/6/edit"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-01T02:38:45.411123",
        "page": "/notes/6/edit"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-01T18:12:52.254401",
        "page": "/notes"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-01T18:29:52.997740",
        "page": "/notes/6/edit"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-02T15:28:59.452385",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-03T21:04:10.781354",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-03T21:21:15.212792",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-03T21:46:28.363243",
        "page": "/profile"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-03T23:07:52.185738",
        "page": "/"
      }
    ],
    "pastrychan": [
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T14:15:04.831945",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T15:26:27.100026",
        "page": "/"
      },
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T17:23:40.538709",
        "page": "/"
      }
    ],
    "marcheeseded": [
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T15:34:20.508559",
        "page": "/profile"
      }
    ],
    "marcheesedy": [
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T15:46:52.691643",
        "page": "/profile"
      }
    ],
    "bobby": [
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-10-24T17:27:59.240693",
        "page": "/"
      }
    ],
    "testaccount": [
      {
        "ip": "127.0.0.1",
        "timestamp": "2025-11-03T21:46:38.301719",
        "page": "/"
      }
    ]
  }
}